Comparing Pandas, SqlCellWidget and Magic Sql
=

1.Prepare datasets
=

In [1]:
from asqlcell import datasets
data1 = %sql SELECT * FROM "example.csv"
data2 = datasets.get_random_data(1000)
data1

   id      price  normal
0   0  94.830479    True
1   1  72.969358    True
2   2  59.427536    True
3   3   8.669261    True
4   4  11.028436    True

2.Use *Pandas* to join data1 and data2, then scan 
=

In [2]:
df = data1.join(data2, lsuffix='id', rsuffix='id')
df

   idid    priceid  normalid  idid  priceid  normalid
0     0  94.830479      True     0        0      True
1     1  72.969358      True     1        1      True
2     2  59.427536      True     2        2      True
3     3   8.669261      True     3        3      True
4     4  11.028436      True     4        4      True

3.Use *SqlCellWidget* to join data1 and data2, then scan 
=

In [3]:
from asqlcell import SqlcellWidget
w = SqlcellWidget()
w

SqlcellWidget(data_range=(0, 10), index_sort=('', 0))

4.Use magic *'%%sql'* to join data1 and data2, then scan 
=

In [4]:
%%sql df
SELECT *
FROM data1 JOIN data2 ON (data1.id = data2.id)

SqlcellWidget(data_range=(0, 10), index_sort=('', 0))

5.Use magic *'%sql'* to join data1 and data2, then scan 
=

In [5]:
result = %sql SELECT * FROM data1 JOIN data2 ON (data1.id = data2.id)
result

   id      price  normal  id_2  price_2  normal_2
0   0  94.830479    True     0        0      True
1   1  72.969358    True     1        1      True
2   2  59.427536    True     2        2      True
3   3   8.669261    True     3        3      True
4   4  11.028436    True     4        4      True